Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.ConstructionMethodEnum Enumeration
 The construction methods.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ConstructionMethodEnum
Public Enumeration ConstructionMethodEnum
Members
Member name | Value | Description
FULL | 1 |  The construction method is "full".
BOX | 2 |  The construction method is "box".
SELECTED_PARTS | 3 |  The construction method is "with selected parts".
SELECTED_PARTS_AND_LOADS | 4 |  The construction method is "with selected parts and loads".
FLOOR_BY_SELECTED_PARTS_AND_LOADS | 11 |  The construction method is "floor by selected parts and loads".
See Also
Reference
Tekla.Structures.Analysis Namespace